var express = require('express');
var router = express.Router();
var _ = require("../helpers/_");


router.get('/', function (req, res, next) {
    return res.render('rules', {title: "قوانین"});
});


router.post('/rules', function (req, res, next) {

    var rules = {};

    rules.aboutGames = "- اگر می خواهی در لیگ وارد شوی ، باید اول در سایت ثبت نام کنی .این کار کمتر از یک دقیقه زمان می برد ." + "<br>" +
        "-   پس از ثبت نام در سایت ، یک جان اولیه هدیه می گیری . از اینجا به بعد می توانی با اضافه کردن هر یک از دوستانت با وارد کردن شماره تلفن شان ،  یک جان دیگر نیز هدیه بگیری :)" + "<br>" +
        "- حالا وارد بازی شو. بازی ها هر روز از ساعت 9 صبح تا 3 نصف شب روز سه شنبه 16 خرداد تا یکشنبه 21 خرداد برگزار میشود." + "<br>" +
        "- اگر بازی را بردی که آفرین ! ده امتیاز می گیری و جانت برای بازی بعدی نیز حفظ می شود." + "<br>" +
        "- اما هربار که ببازی ، برای ورود دوباره به گردونه ی رقابت ها ، باید 200 تومان بپردازی ، دویست تا تک تومن." + "<br>" +
        "- پس قیمت هر جان می شود 200 تومان . اما اگر از بسته ی ویژه ی 2000 تومانی استفاده کنی ، علاوه بر ده تا جان ، دو جان دیگر هم هدیه می گیری." + "<br>" +
        "- به بازی کردن ادامه بده . تا ساعت 3 نصفه شب ، کسی که بیشترین برد را کسب کرده باشد بدون دشواری تبلت را از آن خود خواهد کرد ." + "<br>" +
        "- اینکه در رقابت با بقیه ی اعضاء در کجای جدول رده بندی قرار داری را می توانی از اینجا ببینی." + "<br>" +
        "- آماده ای ! وارد شو که هر دقیقه بازی کردن بیشتر یعنی یک گام برداشتن به سوی تبلت ";

    rules.games = [];
    rules.games.push({
        gameType: 'xo',
        title: 'دوز ساده',
        description: 'توی این بازی اگر زودتر از حریفت یک ردیف (ستونی، سطری و یا ضربدری) رو پر کنی برنده می شی.'
    });

    rules.games.push({
        gameType: 'dot',
        title: "نقطه-خط",
        description: 'اگر بتونی مربع های بیشتری درست کنی برنده می شی و امتیاز می گیری.'
    });

    rules.games.push({
        gameType: 'card',
        title: 'کارت حافظه',
        description: 'اگر بتونی کارتهای شبیه به هم بیشتری پیدا کنی یک امتیاز میگیری.'
    });

    rules.games.push({
        gameType: 'battleship',
        title: 'کشتی جنگی',
        description: 'در این بازی باید اول کشتی هایت را در صفحه بچینی و بعد از اینکه چیدی شروع کنی با حریفت بازی کنی. در هر نوبت بازی یه خونه از صفحه حریفت رو انتخاب می کنی و موشک شلیک می کنی. اگر حریفت در اون نقطه کشتی اش را قرار داده بود موشکت بهش برخورد می کنه و اگر تمام خونه های کشتی حریفت رو بزنی، کشتی اش غرق میشه. هر کدوم زودتر همه کشتی های حریفش رو غرق کنه برنده میشه'
    });


    return res.json({
        result: true,
        data: rules
    });
});

module.exports = router;
